MathDaw/SMWM_STM32/Core/Src/main.c
  /* USER CODE END TIM4_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, LCD_DC_Pin|LCD_RST_Pin|LCD_CS_Pin|FLICK_TS_Pin
                          |FLICK_RESET_Pin|MOT_REF_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, LD2_Pin|MOT_DIR1_Pin|MOT_RESET_Pin|MOT_E_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, MOT_MODE1_Pin|MOT_MODE2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LCD_DC_Pin LCD_CS_Pin */
  GPIO_InitStruct.Pin = LCD_DC_Pin|LCD_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_RST_Pin */
  GPIO_InitStruct.Pin = LCD_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(LCD_RST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LD2_Pin MOT_DIR1_Pin MOT_RESET_Pin MOT_E_Pin */
  GPIO_InitStruct.Pin = LD2_Pin|MOT_DIR1_Pin|MOT_RESET_Pin|MOT_E_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : FLICK_TS_Pin */
  GPIO_InitStruct.Pin = FLICK_TS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(FLICK_TS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : FLICK_RESET_Pin MOT_REF_Pin */
  GPIO_InitStruct.Pin = FLICK_RESET_Pin|MOT_REF_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : MOT_MODE1_Pin MOT_MODE2_Pin */
  GPIO_InitStruct.Pin = MOT_MODE1_Pin|MOT_MODE2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void StInit(void)
{
	/* Stepstick */
	  HAL_TIM_Base_Start(&htim4);

	  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_RESET);
	  HAL_GPIO_WritePin(MOT_MODE1_GPIO_Port, MOT_MODE1_Pin, GPIO_PIN_RESET);
	  HAL_GPIO_WritePin(MOT_MODE2_GPIO_Port, MOT_MODE2_Pin, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_SET);

	  /* LCD */
	  BSP_LCD_Init();
	  BSP_LCD_DisplayOn();

	  /* Sensors */
	  HAL_I2C_Init(&hi2c1);
	  HAL_I2C_Init(&hi2c2);

	  /* Flick */
	  flick_reset();
	  flick_set_param(0x90, 0x20, 0x20);


  stepper = stepper_inizialize(
			GPIOC, GPIO_PIN_7,
			GPIOA, GPIO_PIN_8,
			GPIOA, GPIO_PIN_9,
			GPIOA, GPIO_PIN_10,
			GPIOB, GPIO_PIN_4,
			GPIOB, GPIO_PIN_6,
			&htim2, TIM_CHANNEL_2);


	  /* IMU */
	  uint8_t i2c2_buf[10];
	  HAL_I2C_Mem_Read(&hi2c2, ACC_GYRO_ADDR, WHO_AM_I, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  HAL_I2C_Mem_Read(&hi2c2, 0x1e<<1, 0x0f, I2C_MEMADD_SIZE_8BIT, i2c2_buf+1, 1, 1);

	  /* cfg gyro */
	  i2c2_buf[0] = 0x38;		// enable X,Y,Z axes
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL10_C, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  i2c2_buf[0] = 0x14;		// 13 Hz ODR, 500 dps
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL2_G, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);

	  // cfg acc
	  i2c2_buf[0] = 0x38;		// enable X,Y,Z axes
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL9_XL, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  i2c2_buf[0] = 0x10;		// 13 Hz ODR, +/- 2 g
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL1_XL, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);

	  current_state = ST_MENU;
}

void StMenu(void)
{
	if(current_state != last_state)
	{
		char str[40];
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "MENU");
		BSP_LCD_DisplayStringAt(0, 1, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "Wybierz opcje:");
		BSP_LCD_DisplayStringAt(0, 15, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "<- Wybor trybu");
		BSP_LCD_DisplayStringAt(0, 70, (uint8_t *) str, LEFT_MODE);

		sprintf(str, "Ustaw predkosc ->");
		BSP_LCD_DisplayStringAt(0, 90, (uint8_t *) str, RIGHT_MODE);

		sprintf(str, "Aktywuj");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);

		last_state = current_state;
	}

	// Odczyt gestu flick
	flick_poll_data(&gesture, &touch, &airwheel);
	HAL_Delay(10);
	flick_interaction_t interaction=flick_get_interaction(gesture,touch,airwheel);

	// Przejście do odpowiedniego stanus

	if(interaction == FLICK_TOUCH_LEWO)
	{
		current_state = ST_EDIT;
	}
	else if(interaction == FLICK_TOUCH_PRAWO)
	{
		current_state = ST_SPEED;
	}
	else if(interaction == FLICK_TOUCH_DOL)
	{
		current_state = select_mode;
	}
}
void StAzimuth(void)
{
	char str[40];
	uint8_t angle = 0;
	uint8_t last_angle = 0;

	// odczyt z magnetometru
	// wywolanie funkcji kierunek
	angle = kierunek_kompas(&hi2c2);	//0-255

	flick_poll_data(&gesture, &touch, &airwheel);

	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Utrzymanie azymutu");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);
		BSP_LCD_DisplayStringAt(0, 20, "N", CENTER_MODE);

		sprintf(str, "Powrot do MENU");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}

